PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_hw.c
/***************************************************************************//**
* \file cy_crypto_core_hw.c
* \version 2.150
*
* \brief
*  This file provides the source code to the API for the utils
*  in the Crypto driver.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2024), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto_common.h"

#if defined(__cplusplus)
extern "C" {
#endif

#include "cy_crypto_core_hw.h"
#include "cy_crypto_core_hw_vu.h"
#include "cy_crypto_core_mem.h"
#include "cy_syslib.h"
#include <stdbool.h>

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 4, \
                             'CRYPTO_Type will typecast to either CRYPTO_V1_Type or CRYPTO_V2_Type but not both on PDL initialization based on the target device at compile time.')
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 14.3', 2, \
                             'Since value of CY_CRYPTO_V1 is decided by PDL device agnostic / hardware specific model, controlling expression will not have an invariant value.')

#if !defined(CY_CRYPTO_SERVICE_LIBRARY_LEVEL)
#define CY_CRYPTO_SERVICE_LIBRARY_LEVEL CY_CRYPTO_FULL_LIBRARY
#endif

#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
#include "cy_crypto_core_hw_v2.h"
#endif
/*******************************************************************************
*                   Global Variables
*******************************************************************************/

static uint32_t  cy_cryptoVuMemSize = 0u;

#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)
/* This is set in Cy_Crypto_Core_Enable() to the device information relevant
 * for the current target.
 */
const cy_stc_cryptoIP_t *cy_cryptoIP = NULL;

/* Platform and peripheral crypto block configuration */
const cy_stc_cryptoIP_t cy_cryptoIpBlockCfgPSoC6_01 =
{
    /* CRYPTO register offsets */
    /* cryptoStatusOffset        */ offsetof(CRYPTO_V1_Type, STATUS),
    /* cryptoIstrFfCtlOffset     */ offsetof(CRYPTO_V1_Type, INSTR_FF_CTL),
    /* cryptoInstrFfStatusOffset */ offsetof(CRYPTO_V1_Type, INSTR_FF_STATUS),
    /* cryptoInstrFfWrOffset     */ offsetof(CRYPTO_V1_Type, INSTR_FF_WR),
    /* cryptoVuRfDataOffset      */ offsetof(CRYPTO_V1_Type, RF_DATA),
    /* cryptoAesCtlOffset        */ offsetof(CRYPTO_V1_Type, AES_CTL),
    /* cryptoPrResultOffset      */ offsetof(CRYPTO_V1_Type, PR_RESULT),
    /* cryptoTrResultOffset      */ offsetof(CRYPTO_V1_Type, TR_RESULT),
    /* cryptoCrcCtlOffset        */ offsetof(CRYPTO_V1_Type, CRC_CTL),
    /* cryptoCrcDataCtlOffset    */ offsetof(CRYPTO_V1_Type, CRC_DATA_CTL),
    /* cryptoCrcPolCtlOffset     */ offsetof(CRYPTO_V1_Type, CRC_POL_CTL),
    /* cryptoCrcRemCtlOffset     */ offsetof(CRYPTO_V1_Type, CRC_REM_CTL),
    /* cryptoCrcRemResultOffset  */ offsetof(CRYPTO_V1_Type, CRC_REM_RESULT),
    /* cryptoVuCtl0Offset        */ offsetof(CRYPTO_V1_Type, VU_CTL0),
    /* cryptoVuCtl1Offset        */ offsetof(CRYPTO_V1_Type, VU_CTL1),
    /* cryptoVuStatusOffset      */ offsetof(CRYPTO_V1_Type, VU_STATUS),
    /* cryptoIntrOffset          */ offsetof(CRYPTO_V1_Type, INTR),
    /* cryptoIntrSetOffset       */ offsetof(CRYPTO_V1_Type, INTR_SET),
    /* cryptoIntrMaskOffset      */ offsetof(CRYPTO_V1_Type, INTR_MASK),
    /* cryptoIntrMaskedOffset    */ offsetof(CRYPTO_V1_Type, INTR_MASKED),
    /* cryptoMemBufOffset        */ offsetof(CRYPTO_V1_Type, MEM_BUFF),
};

const cy_stc_cryptoIP_t cy_cryptoIpBlockCfgPSoC6_02 =
{
    /* CRYPTO register offsets */
    /* cryptoStatusOffset        */ offsetof(CRYPTO_V2_Type, STATUS),
    /* cryptoIstrFfCtlOffset     */ offsetof(CRYPTO_V2_Type, INSTR_FF_CTL),
    /* cryptoInstrFfStatusOffset */ offsetof(CRYPTO_V2_Type, INSTR_FF_STATUS),
    /* cryptoInstrFfWrOffset     */ offsetof(CRYPTO_V2_Type, INSTR_FF_WR),
    /* cryptoVuRfDataOffset      */ offsetof(CRYPTO_V2_Type, VU_RF_DATA),
    /* cryptoAesCtlOffset        */ offsetof(CRYPTO_V2_Type, AES_CTL),
    /* cryptoPrResultOffset      */ offsetof(CRYPTO_V2_Type, PR_RESULT),
    /* cryptoTrResultOffset      */ offsetof(CRYPTO_V2_Type, TR_RESULT),
    /* cryptoCrcCtlOffset        */ offsetof(CRYPTO_V2_Type, CRC_CTL),
    /* cryptoCrcDataCtlOffset    */ offsetof(CRYPTO_V2_Type, CRC_DATA_CTL),
    /* cryptoCrcPolCtlOffset     */ offsetof(CRYPTO_V2_Type, CRC_POL_CTL),
    /* cryptoCrcRemCtlOffset     */ offsetof(CRYPTO_V2_Type, CRC_REM_CTL),
    /* cryptoCrcRemResultOffset  */ offsetof(CRYPTO_V2_Type, CRC_REM_RESULT),
    /* cryptoVuCtl0Offset        */ offsetof(CRYPTO_V2_Type, VU_CTL0),
    /* cryptoVuCtl1Offset        */ offsetof(CRYPTO_V2_Type, VU_CTL1),
    /* cryptoVuStatusOffset      */ offsetof(CRYPTO_V2_Type, VU_STATUS),
    /* cryptoIntrOffset          */ offsetof(CRYPTO_V2_Type, INTR),
    /* cryptoIntrSetOffset       */ offsetof(CRYPTO_V2_Type, INTR_SET),
    /* cryptoIntrMaskOffset      */ offsetof(CRYPTO_V2_Type, INTR_MASK),
    /* cryptoIntrMaskedOffset    */ offsetof(CRYPTO_V2_Type, INTR_MASKED),
    /* cryptoMemBufOffset        */ offsetof(CRYPTO_V2_Type, MEM_BUFF),
};
#endif

/* The defines of the power modes of the CRYPTO */
#define CY_CRYPTO_PWR_MODE_OFF               (0UL)
#define CY_CRYPTO_PWR_MODE_RETAINED          (2UL)
#define CY_CRYPTO_PWR_MODE_ENABLED           (3UL)

