PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_hw.c
/*******************************************************************************
* Function Name: Cy_Crypto_Core_Vu_RunInstr
*****************************************************************************//**
*
* Run the Crypto Vector Unit instruction with one parameter.
*
* \param base
* The pointer to the CRYPTO instance.

* \param blockingMode
* Sets the blocking or non-blocking operation mode.
*
* \param instr
* The Opcode of the called instruction.
*
* \param params
* The parameters for the instruction operand.
*
*******************************************************************************/
void Cy_Crypto_Core_Vu_RunInstr(CRYPTO_Type *base, bool blockingMode, uint32_t instr, uint32_t params)
{
    bool isRelocated = Cy_Crypto_Core_GetVuMemoryAddress(base) != REG_CRYPTO_MEM_BUFF(base);

    /* Check whether FIFO has enough space for 1 instruction */
    Cy_Crypto_Core_WaitForInstrFifoAvailable(base, CY_CRYPTO_INSTR_SINGLE);

    REG_CRYPTO_INSTR_FF_WR(base) = (uint32_t)((instr << CY_CRYPTO_OPCODE_POS) | (params));

    if ((blockingMode) || (isRelocated))
    {
        Cy_Crypto_Core_WaitForFifoAvailable(base);
        Cy_Crypto_Core_Vu_WaitForComplete(base);
    }
}

/**
* \addtogroup group_crypto_lld_hw_functions
* \{
*/

/*******************************************************************************
* Function Name: Cy_Crypto_Core_ClearVuRegisters
****************************************************************************//**
*
* The function to initialize the Crypto VU registers.
*
* \param base
* The pointer to the CRYPTO instance.
*
*******************************************************************************/
void Cy_Crypto_Core_ClearVuRegisters(CRYPTO_Type *base)
{
    if (Cy_Crypto_Core_IsEnabled(base))
    {
        /* Clear whole register file */
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG14, 0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG13, 0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG12, 0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG11, 0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG10, 0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG9,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG8,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG7,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG6,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG5,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG4,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG3,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG2,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG1,  0u, 1u);
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG0,  0u, 1u);

        /* Set the stack pointer to the Crypto buff size, in words */
        CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG15, cy_cryptoVuMemSize / 4u, 1u);
    }
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_SetVuMemoryAddress
****************************************************************************//**
*
* Sets the new memory buffer address and size.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param vuMemoryAddr
* The memory buffer location that will be used as Crypto MEM_BUFF and it should be aligned to the vuMemorySize
*
* \param vuMemorySize
* The provided memory buffer size in bytes.
*
* \return
* \ref cy_en_crypto_status_t
*
* \note This function sets the default device specific values
*       when vuMemoryAddr parameter is NULL and vuMemorySize parameter is zero.
*
* \note New memory buffer should be allocated in a memory region that is not
*       protected by a protection scheme for use by Crypto hardware.
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_SetVuMemoryAddress(CRYPTO_Type *base,
        uint32_t const *vuMemoryAddr, uint32_t vuMemorySize)
{
    cy_en_crypto_status_t resultVal = CY_CRYPTO_BAD_PARAMS;
    uint32_t *vuMemAddrRemap = (uint32_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(vuMemoryAddr);
    uint32_t *vuMemAddrIn = (uint32_t *)vuMemoryAddr;

    uint32_t  vuMemSize = vuMemorySize;
    bool  isVUInternalMem = false;

#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)
    if (cy_cryptoIP != NULL)
    {
#endif
        if (REG_CRYPTO_MEM_BUFF(base) == vuMemoryAddr)
        {
            isVUInternalMem = true;
        }

        if ((vuMemAddrIn == NULL) && (vuMemSize == 0uL))
        {
            vuMemAddrIn = REG_CRYPTO_MEM_BUFF(base);
            vuMemSize = CY_CRYPTO_MEM_BUFF_SIZE;
            vuMemAddrRemap = vuMemAddrIn;
        }

        /* Check for new memory size is less or equal to maximal IP allowed value */
        if ((vuMemAddrIn != NULL) && (vuMemSize != 0uL) && (vuMemSize <= 32768u))
        {
            /* mxcrypto (V1) IP uses MEM_BUF aligned to 16KB */
            uint32_t memAlignMask = 16384uL - 1uL;

            uint32_t memFrameMask = 0xFFFFFFFFuL;
            /*
            Specifies the size of  the vector operand memory region.
            Legal values:
            "0b0000000":  32 KB memory region (VU_CTL1.ADDR[14:8] ignored).
            "0b1000000":  16 KB memory region (VU_CTL1.ADDR[13:8] ignored).
            "0b1100000":   8 KB memory region (VU_CTL1.ADDR[12:8] ignored).
            "0b1110000":   4 KB memory region (VU_CTL1.ADDR[11:8] ignored).
            "0b1111000":   2 KB memory region (VU_CTL1.ADDR[10:8] ignored).
            "0b1111100":   1 KB memory region (VU_CTL1.ADDR[9:8]  ignored).
            "0b1111110": 512  B memory region (VU_CTL1.ADDR[8]    ignored).
            "0b1111111": 256  B memory region.
            */
            switch (vuMemSize)
            {
            /* "0b0000000": 32 KB memory region (VU_CTL1.ADDR[14:8] ignored). */
            case 32768uL:
                memFrameMask = 0x0u;
                break;
            /* "0b1000000": 16 KB memory region (VU_CTL1.ADDR[13:8] ignored). */
            case 16384uL:
                memFrameMask = 0x40u;
                break;
            /* "0b1100000":  8 KB memory region (VU_CTL1.ADDR[12:8] ignored). */
            case 8192uL:
                memFrameMask = 0x60u;
                break;
            /* "0b1110000":  4 KB memory region (VU_CTL1.ADDR[11:8] ignored). */
            case 4096uL:
                memFrameMask = 0x70u;
                break;
            /* "0b1111000":  2 KB memory region (VU_CTL1.ADDR[10:8] ignored). */
            case 2048uL:
                memFrameMask = 0x78u;
                break;
            /* "0b1111100":  1 KB memory region (VU_CTL1.ADDR[9:8]  ignored). */
            case 1024uL:
                memFrameMask = 0x7Cu;
                break;
            /* "0b1111110": 512 B memory region (VU_CTL1.ADDR[8]    ignored). */
            case 512uL:
                memFrameMask = 0x7Eu;
                break;
            /* "0b1111111": 256 B memory region (default for HW). */
            case 256uL:
                memFrameMask = 0x7Fu;
                break;
            default:
                /* Unknown mask */
                break;
            }

            if (memFrameMask != 0xFFFFFFFFuL)
            {
#if !defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
                if (!(CY_CRYPTO_V1))
                {
                    memAlignMask = vuMemSize - 1uL;
                }
#endif

