PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_hw.c
                /* Use the new address when it aligned to appropriate memory block size */
                if (((uint32_t)vuMemAddrIn & (memAlignMask)) == 0uL)
                {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
                    if (!(CY_CRYPTO_V1))
                    {
                        REG_CRYPTO_VU_CTL2(base) = _VAL2FLD(CRYPTO_V2_VU_CTL2_MASK, memFrameMask);
                    }
#endif

                    /* For Internal memory VU operation, Crypto CTL register should always point to Non-secure memory address
                    for both Secure & Non-Secure execution */
                    if (isVUInternalMem)
                    {
                        REG_CRYPTO_VU_CTL1(base) = (uint32_t)REG_CRYPTO_MEM_BUFF((uint32_t *)CY_CRYPTO_VU_MEM_NS_ALIAS_ADDRESS(base));
                    }
                    else
                    {
                        REG_CRYPTO_VU_CTL1(base) = (uint32_t)vuMemAddrRemap;
                    }

                    /* Set the stack pointer to the Crypto buff size, in words */
                    CY_CRYPTO_VU_SET_REG(base, CY_CRYPTO_VU_HW_REG15, vuMemSize / 4u, 1u);

                    cy_cryptoVuMemSize = vuMemSize;

                    resultVal = CY_CRYPTO_SUCCESS;
                }
            }
        }
#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)
    }
#endif
    return resultVal;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_GetVuMemorySize
****************************************************************************//**
*
* Get Crypto memory buffer size
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* The current MEM_BUFF size in bytes.
*
*******************************************************************************/
uint32_t Cy_Crypto_Core_GetVuMemorySize(CRYPTO_Type *base)
{
    uint32_t memSize = CY_CRYPTO_MEM_BUFF_SIZE;

#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)
    if ((cy_cryptoIP != NULL) && (cy_cryptoVuMemSize != 0uL))
    {
#endif
        if (CY_CRYPTO_V1)
        {
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
            memSize = cy_cryptoVuMemSize;
#endif
        }
        else
        {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
            uint32_t memFrameMask = _FLD2VAL(CRYPTO_V2_VU_CTL2_MASK, REG_CRYPTO_VU_CTL2(base));
            /*
            Specifies the size of  the vector operand memory region.
            Legal values:
            "0b0000000":  32 KB memory region.
            "0b1000000":  16 KB memory region.
            "0b1100000":   8 KB memory region.
            "0b1110000":   4 KB memory region.
            "0b1111000":   2 KB memory region.
            "0b1111100":   1 KB memory region.
            "0b1111110": 512  B memory region.
            "0b1111111": 256  B memory region.
            */
            switch (memFrameMask)
            {
            case 0x0u:
                memSize = 32768uL;
                break;
            case 0x40u:
                memSize = 16384uL;
                break;
            case 0x60u:
                memSize = 8192uL;
                break;
            case 0x70u:
                memSize = 4096uL;
                break;
            case 0x78u:
                memSize = 2048uL;
                break;
            case 0x7Cu:
                memSize = 1024uL;
                break;
            case 0x7Eu:
                memSize = 512uL;
                break;
            case 0x7Fu:
                memSize = 256uL;
                break;
            default:
                /* Unknown mask */
                break;
            }
#endif
        }
#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)
    }
#endif

    (void)base; /* Suppress a compiler warning about unused variables */

    return memSize;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Enable
****************************************************************************//**
*
* The function to enable the Crypto hardware.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \return
* Crypto status \ref cy_en_crypto_status_t
*
* \funcusage
* \snippet crypto/snippet/main.c snippet_myCryptoCoreStartCryptoUse
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_Enable(CRYPTO_Type *base)
{
#if !defined(CY_CRYPTO_CFG_HW_USE_MPN_SPECIFIC)
    Cy_Crypto_Core_HwInit();
#endif

    /* Disable Crypto HW */
    REG_CRYPTO_CTL(base) &= ~(_VAL2FLD(CRYPTO_CTL_ENABLED,  1uL));

    if (CY_CRYPTO_V1)
    {
        /* Enable Crypto HW */
#if defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
        REG_CRYPTO_CTL(base) = (uint32_t)(_VAL2FLD(CRYPTO_CTL_PWR_MODE, CY_CRYPTO_PWR_MODE_ENABLED) |
                                          _VAL2FLD(CRYPTO_CTL_ENABLED,  1uL));
#endif
    }
    else
    {
#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)
        REG_CRYPTO_CTL(base) &= ~(_VAL2FLD(CRYPTO_V2_CTL_ENABLED,  1uL) | _VAL2FLD(CRYPTO_V2_CTL_ECC_EN, 1uL));

        REG_CRYPTO_INSTR_FF_CTL(base) = (uint32_t)(_VAL2FLD(CRYPTO_V2_INSTR_FF_CTL_BLOCK, 1u)
                                        | _VAL2FLD(CRYPTO_V2_INSTR_FF_CTL_CLEAR, 0u)
                                        | _VAL2FLD(CRYPTO_V2_INSTR_FF_CTL_EVENT_LEVEL, 1u));

        REG_CRYPTO_CTL(base) |= _VAL2FLD(CRYPTO_V2_CTL_ENABLED,  1uL);

        REG_CRYPTO_RAM_PWR_CTL(base) = (uint32_t)(CY_CRYPTO_PWR_MODE_ENABLED);
#endif
    }

    /*
    Specifies if a conditional instruction is executed or not, when its condition
    code evaluates to false("0"):
      "0": The instruction is NOT executed. As a result, the instruction may be
           handled faster than when it is executed.
      "1": The instruction is executed, but the execution result (including
           status field information) is not reflected in the IP. The instruction
           is handled just as fast as when it is executed.
    */
    REG_CRYPTO_VU_CTL0(base) = (uint32_t)1u;

    if (0uL == cy_cryptoVuMemSize)
    {
        /* Set the memory address and set stack pointer to the Crypto buff size, in words */
        (void)Cy_Crypto_Core_SetVuMemoryAddress(base, REG_CRYPTO_MEM_BUFF(base), CY_CRYPTO_MEM_BUFF_SIZE);
    }

    /* Clear whole register file */
    Cy_Crypto_Core_ClearVuRegisters(base);

    return (CY_CRYPTO_SUCCESS);
}

